app/controllers/api/books_controller.rb

SELECT COUNT(*) FROM "books"
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
    def index
      @books = Book.order(created_at: :desc).page(params[:page]).per(50)
      render json: {
        data: ActiveModelSerializers::SerializableResource.new(@books, each_serializer: BookSerializer),
        page: params[:page] || 1,
        hasNext: @books.next_page.present?

INSERT INTO "books" ("name", "author", "ISBN", "publisher", "year", "created_at", "updated_at", "skills", "coverURL") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
      @book = Book.new(book_params)
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 112], ["LIMIT", 1]]
UPDATE "books" SET "updated_at" = ?, "coverURL" = ? WHERE "books"."id" = ?  [["updated_at", "2024-05-02 03:15:22.790962"], ["coverURL", "https://m.media-amazon.com/images/I/612d4maZnpL._AC_UF1000,1000_QL80_.jpg"], ["id", 112]]
---
    def update
      @book = Book.find(params[:id])
      if @book.update(book_params)