app/controllers/api/topics_controller.rb

    def index
      @topics = Topic.where(book_id: params[:book_id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."book_id" = ?  [["book_id", 110]]

    def create
      @topic = Topic.new(topic_params)
      if @topic.save
---
INSERT INTO "topics" ("tag", "description", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["tag", "Science"], ["description", "How to Pick a Science Research Topic & Idea"], ["book_id", 110], ["created_at", "2024-05-01 22:40:19.346696"], ["updated_at", "2024-05-01 22:40:19.346696"]]

    def update
      @topic = Topic.find(params[:id])
      if @topic.update(topic_params)
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "topics" SET "tag" = ?, "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["tag", "Movies"], ["description", "What did you watch yesterday?"], ["updated_at", "2024-05-01 23:48:03.163816"], ["id", 7]]

    def destroy
      @topic = Topic.find(params[:id])
      @topic.destroy
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 7]]

    def unique_tags
      tags = Topic.where.not(tag: [nil, ""]).select(:tag).distinct.pluck(:tag)
---
SELECT DISTINCT "topics"."tag" FROM "topics" WHERE NOT (("topics"."tag" = ? OR "topics"."tag" IS NULL))  [["tag", ""]]

    def search
      topics = Topic.joins(:book).where(nil)

      # Topic based attributes
      topics = topics.where('LOWER(topics.tag) LIKE LOWER(?)', "%#{params[:tag]}%") if params[:tag].present?
      topics = topics.where('LOWER(topics.description) LIKE LOWER(?)', "%#{params[:description]}%") if params[:description].present?

      # Book based attributes
      topics = topics.where('LOWER(books.name) LIKE LOWER(?)', "%#{params[:book_name]}%") if params[:book_name].present?
      topics = topics.where('LOWER(books.author) LIKE LOWER(?)', "%#{params[:author]}%") if params[:author].present?
      topics = topics.where('LOWER(books.publisher) LIKE LOWER(?)', "%#{params[:publisher]}%") if params[:publisher].present?
      topics = topics.where('books.year = ?', params[:year]) if params[:year].present?
      topics = topics.where('books.ISBN = ?', params[:ISBN]) if params[:ISBN].present?
      # TODO
      # topics = topics.where('books.skills @> ARRAY[?]::varchar[]', params[:skill]) if params[:skills].present?


      topics = topics.limit(50)
---
SELECT "topics".* FROM "topics" INNER JOIN "books" ON "books"."id" = "topics"."book_id" WHERE (topics.tag ILIKE '%a%') LIMIT ?  [["LIMIT", 50]]